Revit 2024 API
SpecTypeId.StationingInterval Property
 Stationing Interval, in discipline Infrastructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId StationingInterval { get; }
Visual Basic
Public Shared ReadOnly Property StationingInterval As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StationingInterval {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace